# Рядки (strings)
# Завдання 1: Дано рядок name = "Anna". Виведіть кожну літеру на окремому рядку.
# Завдання 2: Дано рядок greeting = "Hello". Використовуючи цикл for, виведіть цей рядок три рази.
# Списки (lists)
# Завдання 3: Створіть список чисел [1, 2, 3] і виведіть кожен елемент списку на окремому рядку.
# Завдання 4: Дано список імен names = ["Alice", "Bob", "Charlie"]. Виведіть кожне ім’я на екран
# Кортежі (tuples)
# Завдання 6: Дано кортеж colors = ("red", "green", "blue"). Використовуючи цикл for, виведіть кожен колір на окремому рядку.
# Завдання 7: Створіть кортеж чисел (2, 4, 6, 8) і порахуйте їхню суму.
# . Словники (dicts)
# Завдання 8: Дано словник ages = {'Alice': 22, 'Bob': 25, 'Charlie': 30}. Виведіть ім’я та вік кожної людини.
# Завдання 9: Створіть словник з трьох предметів (наприклад, {'pencil': 5, 'pen': 10, 'eraser': 3}) і виведіть назву предмета та його кількість на окремому рядку.
# Множини (sets)
# Завдання 10: Дано множину чисел {1, 3, 5, 7}. Використовуючи цикл for, виведіть кожне число на окремому рядку.
# Списки з умовами
# Завдання 11: Дано список чисел [10, 15, 20, 25, 30]. Використовуючи цикл for, виведіть лише ті числа, які більше 20.
# Простий цикл for з функцією range()
# Завдання 12: Використовуючи for з range(), виведіть числа від 1 до 5.


#Task1
# name = "Anna"
# for i in name:
#   print(i)

#Task2
# greeting = "Hello"
# print(greeting*3)
# greeting = "Hello"

# for i  in range(3):
#  print(greeting)


#Task3
# numbers=[1, 2, 3]
# for i in numbers:
#   print(i)

#Task4
# names = ["Alice", "Bob", "Charlie"]
# for i in range(len(names)):
#   print(names[i])
  
  
#Task6
# colors = ("red", "green", "blue")
# for i in colors:
#   print(i)  


#Task7
# my_numbers=(2, 4, 6, 8)
# sum=0
# for i in my_numbers:
#   sum+=i
#   print(sum)

#Task8
# ages = {'Alice': 22, 'Bob': 25, 'Charlie': 30}
# for x,y in ages.items():
#   print(x,y)


#Task9

# my_subject= {'pencil': 5, 'pen': 10, 'eraser': 3}
# for x,y in my_subject.items():
#   print(x,y)

#Task10
# my_set={1, 3, 5, 7}
# for x in my_set:
#   print(x)


#Task11
# my_numbers1=[10, 15, 20, 25, 30]
# for x in my_numbers1:
#   if x>20 :
#    print(x)
#   else:
#     continue  

#Task 12
# for x in range(1,6):
#   print(x)


#  Зміна ключів
# Дано словник, де ключами є імена студентів, а значеннями — списки з їхніми оцінками з різних предметів.
# Наприклад: {'Anna': [85, 90, 78], 'John': [70, 80, 75]}.
# Напишіть програму, яка створить новий словник, де ключами будуть імена студентів, а значеннями — їхній середній бал.
# 2.   Пошук дублюючих значень
# Напишіть програму, яка виявить, чи є дубльовані оцінки в списку значень словника студентів.
# Наприклад, якщо оцінка 85 зустрічається більше одного разу серед різних студентів, виведіть відповідне повідомлення.
# 3.   Зберігання результатів з вкладених словників
# У словнику зберігаються дані про кожного студента та оцінки з предметів у вигляді вкладених словників.
# Наприклад: { 'Anna': {'math': 90, 'english': 85}, 'Bohdan': {'math': 78, 'english': 88} }.
# Напишіть код, який обчислить середню оцінку кожного студента по всіх предметах та загальну середню оцінку по групі.


#Task1.1
# students_dict={'Anna': [85, 90, 78], 'John': [70, 80, 75]}

# for score  in students_dict.values():
#    sum=0
#    count=0
#    for s in len(score):
  
#     sum +=s
#     count+=1
#    aver_score=sum/count
# students_dict['score']=aver_score
# print(students_dict)